qq654704712/esp32-codex-companion/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_HANDLE_REPEAT_PAIRING_DELETION=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# The device hosts an LCD DMA pipeline, BLE and a SoftAP provisioning portal.
# Keep Wi-Fi/LwIP pools in the verified 8 MB PSRAM so the SoftAP beacon always
# has contiguous internal memory available.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=3
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=6
CONFIG_FREERTOS_HZ=1000
# The Waveshare display driver initializes LVGL and the LCD from app_main.
# Its call chain exceeds ESP-IDF's 3584-byte default before the app can move
# work into its own tasks, so reserve a safe main-task stack budget.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# USB compatibility mode exposes the board as a native, input-only macOS UAC
# microphone. It is selected explicitly from Connection Center and takes
# effect after reboot; normal firmware keeps the USB Serial/JTAG flash path.
CONFIG_UAC_TUSB_MANUFACTURER="Codex Companion"
CONFIG_UAC_TUSB_PRODUCT="Codex Companion USB Mic"
CONFIG_UAC_TUSB_PID=0x8001
CONFIG_UAC_SPEAKER_CHANNEL_NUM=0
CONFIG_UAC_MIC_CHANNEL_NUM=1
CONFIG_UAC_SAMPLE_RATE=16000
CONFIG_UAC_MIC_INTERVAL_MS=20
CONFIG_UAC_SUPPORT_MACOS=y
# CCW2 Wi-Fi control frames use ChaCha20-Poly1305. ESP-IDF disables this
# optional primitive by default, so all three dependencies are explicit.
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
